УНФ_ТЕСТ/src/Enums/ВариантыПечатиПрайсЛиста/ВариантыПечатиПрайсЛиста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыПечатиПрайсЛиста</name>
  <enumValues>
    <name>Полотно</name>
  </enumValues>
  <enumValues>
    <name>ДвеКолонки</name>
  </enumValues>
  <enumValues>
    <name>Диафильм</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Enums/ВидСравненияЗначений/ВидСравненияЗначений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидСравненияЗначений</name>
  <enumValues>
    <name>Больше</name>
  </enumValues>
  <enumValues>
    <name>БольшеИлиРавно</name>
  </enumValues>
  <enumValues>
    <name>Меньше</name>
  </enumValues>
  <enumValues>
    <name>МеньшеИлиРавно</name>
  </enumValues>
  <enumValues>
    <name>Равно</name>
  </enumValues>
  <enumValues>
    <name>НеРавно</name>
  </enumValues>
  <enumValues>
    <name>ВСписке</name>
  </enumValues>
  <enumValues>
    <name>ВИнтервале</name>
  </enumValues>
  <enumValues>
    <name>ВИнтервалеВключая</name>
  </enumValues>
  <enumValues>
    <name>ВИнтервалеВключаяЛево</name>
  </enumValues>
  <enumValues>
    <name>ВИнтервалеВключаяПраво</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/CommonModules/ЦенообразованиеКлиент/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// По выбранным полям в таблице ПредставлениеНоменклатуры формируется строковое представление номенклатуры в прайс-листе
//
Функция ПредставлениеНоменклатурыСтрокой(ПредставлениеНоменклатуры, ПараметрыКартинки = Неопределено) Экспорт
	
	СоставРеквизитов = "";
	Для каждого Строка Из ПредставлениеНоменклатуры Цикл
		
		Если Строка.Использование Тогда
			
			СоставРеквизитов = СоставРеквизитов + ?(ПустаяСтрока(СоставРеквизитов), "", ", ") + Строка.РеквизитПредставление;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТипЗнч(ПараметрыКартинки) = Тип("Структура") Тогда
		
		СоставРеквизитов = СоставРеквизитов + СтрШаблон(НСтр("ru =', Колонок: %1, Размер: %2 х %3'"), ПараметрыКартинки.КоличествоКолонок, ПараметрыКартинки.КартинкаШирина, ПараметрыКартинки.КартинкаВысота);
		
	КонецЕсли;
	
	Возврат СоставРеквизитов;
	
КонецФункции // ПредставлениеНоменклатурыСтрокой()

// Выполняет обязательные действия при изменении варианта печати
//
Процедура ИзменитьВариантПечатиПрайсЛистаОрганизация(ОбъектФормы, ДополнительныеПараметры) Экспорт
	
	Если ОбъектФормы.ПечатьПрайсЛиста = ПредопределенноеЗначение("Перечисление.ВариантыПечатиПрайсЛиста.Полотно") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ИменаРеквизитовНоменклатуры = Новый Массив(3);
	ИменаРеквизитовНоменклатуры[0] = "Артикул";
	ИменаРеквизитовНоменклатуры[1] = "ПризнакНовинка";
	ИменаРеквизитовНоменклатуры[2] = ?(ОбъектФормы.ПечатьПрайсЛиста = ПредопределенноеЗначение("Перечисление.ВариантыПечатиПрайсЛиста.Диафильм"), "НаименованиеПолное", "Наименование");
	
	Для каждого Строка Из ОбъектФормы.ПредставлениеНоменклатуры Цикл
		
		Строка.Использование = (ИменаРеквизитовНоменклатуры.Найти(Строка.РеквизитНоменклатуры) <> Неопределено);
		
	КонецЦикла;
	
	Если ОбъектФормы.ВидыЦен.Количество() > 1 Тогда
		
		ВидЦенСсылка = ОбъектФормы.ВидыЦен[0].ВидЦен;
		
		ОбъектФормы.ВидыЦен.Очистить();
		НоваяСтрока			= ОбъектФормы.ВидыЦен.Добавить();
		НоваяСтрока.ВидЦен	= ВидЦенСсылка;
		
	КонецЕсли;
	
	ОбъектФормы.МаксимальнаяЦена = Ложь;
	ОбъектФормы.МинимальнаяЦена = Ложь;
	Если ОбъектФормы.ПечатьПрайсЛиста = ПредопределенноеЗначение("Перечисление.ВариантыПечатиПрайсЛиста.Диафильм") Тогда
		
		ОбъектФормы.УсловнаяЦена = Ложь;
		ОбъектФормы.УсловнаяЦенаУсловие = ПредопределенноеЗначение("Перечисление.ВидСравненияЗначений.Меньше");
		ОбъектФормы.УсловнаяЦенаЗначение = 0;
		ОбъектФормы.УсловнаяЦенаЗначениеДо = 0;
		
	КонецЕсли;
	
	ОбъектФормы.ПредставлениеОстатков = 1;
	
КонецПроцедуры // ИзменитьВариантПечатиПрайсЛиста()

#КонецОбласти
